src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИнформационнойБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Сотрудники/ObjectModule.bsl
// @strict-types

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчество) Тогда
		Наименование = Фамилия + " " + Имя + " " + Отчество;
		Логин = Фамилия + Лев(Имя, 1) + Лев(Отчество, 1);
	Иначе
		Наименование = Фамилия + " " + Имя;
		Логин = Фамилия + Лев(Имя, 1);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ИдентификаторПользователяИнформационнойБазы);

	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);

		Если Пользователь = Неопределено Тогда
			Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		КонецЕсли;
	КонецЕсли;

	Пользователь.Имя = Логин;
	Пользователь.ПолноеИмя = Наименование;
	Пользователь.Роли.Добавить(Метаданные.Роли.Сотрудник);

	Для Каждого Роль Из Метаданные.Роли Цикл
		Если Роль.Синоним = Должность.Наименование Тогда
			Пользователь.Роли.Добавить(Роль);
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Пользователь.АутентификацияСтандартная = Истина;
	Пользователь.Пароль = Логин;
	Пользователь.АдресЭлектроннойПочты = ЭлектроннаяПочта;
	Пользователь.ПолноеИмя = Наименование;
	Пользователь.ПоказыватьВСпискеВыбора = Ложь;
	Пользователь.Записать();
	ИдентификаторПользователяИнформационнойБазы = Пользователь.УникальныйИдентификатор;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ИдентификаторПользователяИнформационнойБазы);
	Если Пользователь <> Неопределено Тогда
		Пользователь.Удалить();
	КонецЕсли;
КонецПроцедуры
